src/lisp-in-rust/variables-and-functions/index.org
#+TITLE: Variables and functions

Before moving on to implementing variables and functions, we are gonna improve
the editor experience by adding bracket validation. This is a nice feature to
have, since it forces us to balance the parentheses.

* Improving the editor experience

#+BEGIN_SRC shell
$ cargo add rustyline-derive
    Updating crates.io index
      Adding rustyline-derive v0.7.0 to dependencies.
#+END_SRC

* Demonstration

#+BEGIN_SRC shell
$ cargo run
    Finished dev [unoptimized + debuginfo] target(s) in 0.37s
     Running `target/debug/lisp`
>> (define x 10)
Nil
>> (+ x 20)
Constant(Number(30))
>> (* x x)
Constant(Number(100))
>> (define add (lambda (x y) (+ x y)))
Nil
>> (add 5 10)
Constant(Number(15))
#+END_SRC

#+BEGIN_EXPORT html
<pre>
lisp
├── src
│   └── <a href="./lisp/src/main.rs">main.rs</a>
├── <a href="./lisp/Cargo.lock">Cargo.lock</a>
└── <a href="./lisp/Cargo.toml">Cargo.toml</a>
</pre>
#+END_EXPORT
