lisp-in-rust/variables-and-functions/index.html
<!DOCTYPE html><html lang="en"><head><meta charset="UTF-8"/><title>Variables and functions</title><link rel="stylesheet" href="/styles.css"/></head><body><table width="100%" cellpadding="0" cellspacing="0" border="0" id="header"><td align="left"><b>Variables and functions</b> | <a href=../>Go back</a></td><td align="right">Written by <a href="https://github.com/knarkzel">Knarkzel</a></td></table><p>
Before moving on to implementing variables and functions, we are gonna improve
the editor experience by adding bracket validation. This is a nice feature to
have, since it forces us to balance the parentheses.
</p>

<div id="outline-container-org725e8e6" class="outline-2">
<h2 id="org725e8e6">Improving the editor experience</h2>
<div class="outline-text-2" id="text-org725e8e6">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-tree-sitter-hl-faceXpunctuationXspecial">$</span> <span class="org-tree-sitter-hl-faceXproperty">cargo</span> add rustyline-derive
    <span class="org-tree-sitter-hl-faceXfunctionXcall">Updating</span> crates.io index
      <span class="org-tree-sitter-hl-faceXfunctionXcall">Adding</span> rustyline-derive v0.7.0 to dependencies.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd53990" class="outline-2">
<h2 id="orgfd53990">Demonstration</h2>
<div class="outline-text-2" id="text-orgfd53990">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-tree-sitter-hl-faceXpunctuationXspecial">$</span> <span class="org-tree-sitter-hl-faceXproperty">cargo</span> run
    <span class="org-tree-sitter-hl-faceXfunctionXcall">Finished</span> dev <span class="org-rainbow-delimiters-depth-1">[</span>unoptimized + debuginfo<span class="org-rainbow-delimiters-depth-1">]</span> target<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-tree-sitter-hl-faceXfunctionXcall">s</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tree-sitter-hl-faceXkeyword">in</span> <span class="org-tree-sitter-hl-faceXfunctionXcall">0.37s</span>
     <span class="org-tree-sitter-hl-faceXfunctionXcall">Running</span> <span class="org-tree-sitter-hl-faceXpunctuationXspecial">`</span><span class="org-tree-sitter-hl-faceXembedded"><span class="org-tree-sitter-hl-faceXfunctionXcall">target/debug/lisp</span></span><span class="org-tree-sitter-hl-faceXpunctuationXspecial">`</span>
<span class="org-tree-sitter-hl-faceXoperator">&gt;&gt;</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-tree-sitter-hl-faceXfunctionXcall">define</span> x 10<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-tree-sitter-hl-faceXfunctionXcall">Nil</span>
<span class="org-tree-sitter-hl-faceXoperator">&gt;&gt;</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-tree-sitter-hl-faceXfunctionXcall">+</span> x 20<span class="org-rainbow-delimiters-depth-1">)</span>
Constant<span class="org-rainbow-delimiters-depth-1">(</span>Number<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-tree-sitter-hl-faceXfunctionXcall">30</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-tree-sitter-hl-faceXoperator">&gt;&gt;</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-tree-sitter-hl-faceXfunctionXcall">*</span> x x<span class="org-rainbow-delimiters-depth-1">)</span>
Constant<span class="org-rainbow-delimiters-depth-1">(</span>Number<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-tree-sitter-hl-faceXfunctionXcall">100</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-tree-sitter-hl-faceXoperator">&gt;&gt;</span> <span class="org-rainbow-delimiters-depth-1">(</span>define <span class="org-tree-sitter-hl-faceXfunctionXcall">add</span> <span class="org-rainbow-delimiters-depth-2">(</span>lambda <span class="org-rainbow-delimiters-depth-3">(</span>x y<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-tree-sitter-hl-faceXfunctionXcall">+</span> x y<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-tree-sitter-hl-faceXfunctionXcall">Nil</span>
<span class="org-tree-sitter-hl-faceXoperator">&gt;&gt;</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-tree-sitter-hl-faceXfunctionXcall">add</span> 5 10<span class="org-rainbow-delimiters-depth-1">)</span>
Constant<span class="org-rainbow-delimiters-depth-1">(</span>Number<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-tree-sitter-hl-faceXfunctionXcall">15</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<pre>
lisp
├── src
│   └── <a href="./lisp/src/main.rs">main.rs</a>
├── <a href="./lisp/Cargo.lock">Cargo.lock</a>
└── <a href="./lisp/Cargo.toml">Cargo.toml</a>
</pre>
</div>
</div>
</body></html>
